function DAE_Pend

m = 1;     L = 5;
RT = eps;  AT = eps;
t0 = 0;    tf = 2;
Ns = [100  1000 5000  10000] ;
hs = (tf-t0)./Ns;
BC = [ 0.2  1.2  0.1;  0.2  1.2  0.1;  0.7 1.5  0.3;  -1.1 1.2 -0.5;...
      -1.4  1.8 -0.6; -0.9  1.3 -0.5; -0.3 0.9 -0.2;  -0.3 0.7 -0.4;...
      -0.8  1.1 -0.4; -0.7  1.0 -0.3; -0.3 0.6 -0.3;  -0.8 1.1 -0.4;...
      -0.6  0.7 -0.3;  0.2  0.6  0 ];

Lmn = BC(8,:); 
zam = 2;             % для разгона - ode113
y0I = [3; -4; -4/5; -3/5];
for Nh = 1:length(Ns);  
    h  = hs(Nh);    
    t  = t0:h:tf; 
    op = DSet( h, RT,AT,Lmn, zam);
    [to,y,nf] = ds10(@F_Pend,t,y0I,op,m,L);  
    end